### Terraform Initialization `success`

### Terraform Validation `success`

<details><summary>Validation Output</summary>

```

Success! The configuration is valid.


```

</details>

### Terraform Plan `success`

<details><summary>Show Plan</summary>

```


Terraform used the selected providers to generate the following execution
  + create

Terraform will perform the following actions:

  # google_network_connectivity_spoke.vpn-primary-vpn will be created
  + resource "google_network_connectivity_spoke" "vpn-primary-vpn" {
      + create_time      = (known after apply)
      + description      = "Transit primary VPN spoke"
      + effective_labels = {
          + "goog-terraform-provisioned" = "true"
        }
      + group            = "projects/chspoc-dev-core/locations/global/hubs/ncc-dev-hub/groups/center"
      + hub              = "projects/chspoc-dev-core/locations/global/hubs/ncc-dev-hub"
      + id               = (known after apply)
      + location         = "us-central1"
      + name             = "ncc-d-spoke-landing-transit-primary-vpn"
      + project          = "chspoc-dev-core"
      + reasons          = (known after apply)
      + state            = (known after apply)
      + terraform_labels = {
          + "goog-terraform-provisioned" = "true"
        }
      + unique_id        = (known after apply)
      + update_time      = (known after apply)

      + linked_vpn_tunnels {
          + site_to_site_data_transfer = false
          + uris                       = (known after apply)
        }
    }

  # module.transit-to-landing-dev-primary-vpn.google_compute_router_interface.router_interface["tnn-0"] will be created
  + resource "google_compute_router_interface" "router_interface" {
      + id                  = (known after apply)
      + ip_range            = "169.254.0.26/30"
      + ip_version          = (known after apply)
      + name                = "cri-dev-transit-vpc-vpc-ulan1-us-central1-i0"
      + project             = "chspoc-dev-core"
      + redundant_interface = (known after apply)
      + region              = "us-central1"
      + router              = "cr-d-dev-transit-vpc-us-central1"
      + vpn_tunnel          = "vpn-transit-land-dev-us-central1-tnn-0"
    }

  # module.transit-to-landing-dev-primary-vpn.google_compute_router_interface.router_interface["tnn-1"] will be created
  + resource "google_compute_router_interface" "router_interface" {
      + id                  = (known after apply)
      + ip_range            = "169.254.0.30/30"
      + ip_version          = (known after apply)
      + name                = "cri-dev-transit-vpc-vpc-ulan1-us-central1-i1"
      + project             = "chspoc-dev-core"
      + redundant_interface = (known after apply)
      + region              = "us-central1"
      + router              = "cr-d-dev-transit-vpc-us-central1"
      + vpn_tunnel          = "vpn-transit-land-dev-us-central1-tnn-1"
    }

  # module.transit-to-landing-dev-primary-vpn.google_compute_router_peer.bgp_peer["tnn-0"] will be created
  + resource "google_compute_router_peer" "bgp_peer" {
      + advertise_mode                     = "DEFAULT"
      + advertised_groups                  = []
      + advertised_route_priority          = 1000
      + enable                             = true
      + enable_ipv4                        = (known after apply)
      + enable_ipv6                        = false
      + id                                 = (known after apply)
      + interface                          = "cri-dev-transit-vpc-vpc-ulan1-us-central1-i0"
      + ip_address                         = (known after apply)
      + ipv4_nexthop_address               = (known after apply)
      + ipv6_nexthop_address               = (known after apply)
      + is_advertised_route_priority_set   = (known after apply)
      + is_custom_learned_priority_set     = (known after apply)
      + management_type                    = (known after apply)
      + name                               = "bgpp-dev-transit-vpc-vpc-ulan1-us-central1-i0"
      + peer_asn                           = 65031
      + peer_ip_address                    = "169.254.0.25"
      + peer_ipv4_nexthop_address          = (known after apply)
      + peer_ipv6_nexthop_address          = (known after apply)
      + project                            = "chspoc-dev-core"
      + region                             = "us-central1"
      + router                             = "cr-d-dev-transit-vpc-us-central1"
      + zero_custom_learned_route_priority = false

      + bfd (known after apply)
    }

  # module.transit-to-landing-dev-primary-vpn.google_compute_router_peer.bgp_peer["tnn-1"] will be created
  + resource "google_compute_router_peer" "bgp_peer" {
      + advertise_mode                     = "DEFAULT"
      + advertised_groups                  = []
      + advertised_route_priority          = 1000
      + enable                             = true
      + enable_ipv4                        = (known after apply)
      + enable_ipv6                        = false
      + id                                 = (known after apply)
      + interface                          = "cri-dev-transit-vpc-vpc-ulan1-us-central1-i1"
      + ip_address                         = (known after apply)
      + ipv4_nexthop_address               = (known after apply)
      + ipv6_nexthop_address               = (known after apply)
      + is_advertised_route_priority_set   = (known after apply)
      + is_custom_learned_priority_set     = (known after apply)
      + management_type                    = (known after apply)
      + name                               = "bgpp-dev-transit-vpc-vpc-ulan1-us-central1-i1"
      + peer_asn                           = 65031
      + peer_ip_address                    = "169.254.0.29"
      + peer_ipv4_nexthop_address          = (known after apply)
      + peer_ipv6_nexthop_address          = (known after apply)
      + project                            = "chspoc-dev-core"
      + region                             = "us-central1"
      + router                             = "cr-d-dev-transit-vpc-us-central1"
      + zero_custom_learned_route_priority = false

      + bfd (known after apply)
    }

  # module.transit-to-landing-dev-primary-vpn.google_compute_vpn_tunnel.tunnels["tnn-0"] will be created
  + resource "google_compute_vpn_tunnel" "tunnels" {
      + creation_timestamp      = (known after apply)
      + detailed_status         = (known after apply)
      + effective_labels        = {
          + "goog-terraform-provisioned" = "true"
        }
      + id                      = (known after apply)
      + ike_version             = 2
      + label_fingerprint       = (known after apply)
      + local_traffic_selector  = (known after apply)
      + name                    = "vpn-transit-land-dev-us-central1-tnn-0"
      + peer_gcp_gateway        = "https://www.googleapis.com/compute/v1/projects/chspoc-landing-prj/regions/us-central1/vpnGateways/vpng-d-vpc-ulan1-us-central1"
      + peer_ip                 = (known after apply)
      + project                 = "chspoc-dev-core"
      + region                  = "us-central1"
      + remote_traffic_selector = (known after apply)
      + router                  = "cr-d-dev-transit-vpc-us-central1"
      + self_link               = (known after apply)
      + shared_secret           = (sensitive value)
      + shared_secret_hash      = (known after apply)
      + terraform_labels        = {
          + "goog-terraform-provisioned" = "true"
        }
      + tunnel_id               = (known after apply)
      + vpn_gateway             = "https://www.googleapis.com/compute/v1/projects/chspoc-dev-core/regions/us-central1/vpnGateways/vpng-d-dev-transit-vpc-us-central1"
      + vpn_gateway_interface   = 0
    }

  # module.transit-to-landing-dev-primary-vpn.google_compute_vpn_tunnel.tunnels["tnn-1"] will be created
  + resource "google_compute_vpn_tunnel" "tunnels" {
      + creation_timestamp      = (known after apply)
      + detailed_status         = (known after apply)
      + effective_labels        = {
          + "goog-terraform-provisioned" = "true"
        }
      + id                      = (known after apply)
      + ike_version             = 2
      + label_fingerprint       = (known after apply)
      + local_traffic_selector  = (known after apply)
      + name                    = "vpn-transit-land-dev-us-central1-tnn-1"
      + peer_gcp_gateway        = "https://www.googleapis.com/compute/v1/projects/chspoc-landing-prj/regions/us-central1/vpnGateways/vpng-d-vpc-ulan1-us-central1"
      + peer_ip                 = (known after apply)
      + project                 = "chspoc-dev-core"
      + region                  = "us-central1"
      + remote_traffic_selector = (known after apply)
      + router                  = "cr-d-dev-transit-vpc-us-central1"
      + self_link               = (known after apply)
      + shared_secret           = (sensitive value)
      + shared_secret_hash      = (known after apply)
      + terraform_labels        = {
          + "goog-terraform-provisioned" = "true"
        }
      + tunnel_id               = (known after apply)
      + vpn_gateway             = "https://www.googleapis.com/compute/v1/projects/chspoc-dev-core/regions/us-central1/vpnGateways/vpng-d-dev-transit-vpc-us-central1"
      + vpn_gateway_interface   = 1
    }

Plan: 7 to add, 0 to change, 0 to destroy.

Warning: Value for undeclared variable

The root module does not declare a variable named "universe" but a value was

To silence these warnings, use TF_VAR_... environment variables to provide

Warning: Value for undeclared variable

The root module does not declare a variable named "tag_names" but a value was

To silence these warnings, use TF_VAR_... environment variables to provide

Warning: Values for undeclared variables

In addition to the other similar warnings shown, 6 other variable(s) defined


Saved the plan to: ../plan.out

To perform exactly these actions, run the following command to apply:
    terraform apply "../plan.out"
```

</details>

### Terraform Apply `success`

*Pusher: @leorocca-gg, Action: `pull_request`, Working Directory: ``, Workflow: `FAST networking stage`*